Revit 2024 API
Subelement.IsParameterModifiable Method
 Checks if given parameter of this subelement is modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsParameterModifiable(
	ElementId parameterId
)
Visual Basic
Public Function IsParameterModifiable ( _
	parameterId As ElementId _
) As Boolean
Visual C++
public:
bool IsParameterModifiable(
	ElementId^ parameterId
)
Parameters
parameterId
Type: Autodesk.Revit.DB.ElementId
 Parameter id.
Return Value
 True if given parameter of this subelement is modifiable, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Subelement Class
Autodesk.Revit.DB Namespace